In [15]:
import pandas as pd
from pandas.io import gbq
import plotly.plotly as py
import plotly.graph_objs as go
from plotly import figure_factory as FF

In [16]:
project_id = 'titanic-231219'

In [17]:
pass_query = "SELECT * FROM [titanic-231219.titanic.titanic_passenger]"

In [18]:
pass_df = gbq.read_gbq(pass_query, project_id=project_id)

In [19]:
pass_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [20]:
pass_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [22]:
nulls_age = sum(pd.isnull(pass_df['Age']))

age_null_query = "SELECT ("+str(nulls_age)+"*100)/ COUNT(*) as Porcentaje_Null_Age FROM [titanic-231219.titanic.titanic_passenger]"

age_null_df = gbq.read_gbq(age_null_query, project_id=project_id)

age_null_df


#Se ejecuta la siguiente consulta por medio de "BigQuery Platform"
#update [titanic-231219.titanic.titanic_passenger] set Age = (select ROUND(AVG(Age))  FROM [titanic-231219.titanic.titanic_passenger]) where Age is null

   Porcentaje_Null_Age
0             19.86532

In [23]:
#Proporcion de valores perdidos para la variable "Cabin"

nulls_cabin = sum(pd.isnull(pass_df['Cabin']))

cabin_null_query = "SELECT ("+str(nulls_cabin)+"*100)/ COUNT(*) as Porcentaje_Null_Cabin FROM [titanic-231219.titanic.titanic_passenger]"


cabin_null_df = gbq.read_gbq(cabin_null_query, project_id=project_id)

In [24]:
cabin_null_df

# La cantidad de valores perdidos es muy alto, por lo tanto se elimina esta variable.
# Es elimina la variable "Cabin" por medio de "BigQuery Platform"
#

   Porcentaje_Null_Cabin
0              77.104377

In [34]:
nulls_Embarked = sum(pd.isnull(pass_df['Embarked']))

Embarked_null_query = "SELECT ("+str(nulls_Embarked)+"*100)/ COUNT(*) as Porcentaje_Null_Embarked FROM [titanic-231219.titanic.titanic_passenger]"

Embarked_null_df = gbq.read_gbq(Embarked_null_query, project_id=project_id)

Embarked_null_df

   Porcentaje_Null_Embarked
0                  0.224467

In [41]:
Embarked_top_query = "SELECT Embarked, count(Embarked) FROM [titanic-231219.titanic.titanic_passenger] where Embarked is not null group by Embarked order by Embarked desc limit 1"

Embarked_top_df = gbq.read_gbq(Embarked_top_query, project_id=project_id)

Embarked_top_df

# Se ejecuta el query:
#Update [titanic-231219.titanic.titanic_passenger] set Embarked = 'S' where Embarked is null

  Embarked  f0_
0        S  644

In [46]:
pass_df = gbq.read_gbq(pass_query, project_id=project_id)

pass_df.isnull().sum()
#Ahora no hay datos nulos en el dataset

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [48]:
pass_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,30.0,0,0,239854,0,S
1,733,0,2,"Knight, Mr. Robert J",male,30.0,0,0,239855,0,S
2,675,0,2,"Watson, Mr. Ennis Hastings",male,30.0,0,0,239856,0,S
3,414,0,2,"Cunningham, Mr. Alfred Fleming",male,30.0,0,0,239853,0,S
4,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0,S